[{"description":"Create hero section with Afrobility Family CIC branding, 'United in Care' headline, sub-headline 'Emotional and practical support for families', and prominent 'Get Involved' CTA button in top right. Use dark charcoal background with white typography. Include the family support imagery in a split-screen layout. Color accents in warm ochre/mustard yellow for the button.","type":"feature","passes":true,"id":1},{"description":"Build services section with three-column grid showcasing: Education Guidance (£50), Resource Course (£100), and Support Group (£30) with 'Book Now' buttons. Use warm ochre/mustard accents for buttons. Include professional service card design with descriptions and icons.","type":"feature","passes":true,"id":2},{"description":"Create 'Our Insights' blog section with responsive grid layout displaying three featured articles: 'Navigating Disability Support: A Guide for African Families', 'Building Community: Emotional Support', and 'Culturally Sensitive Resources for Caribbean Families'. Include thumbnail images with overlay text, view counters, and heart icons.","type":"feature","passes":true,"id":3},{"description":"Add upcoming events section displaying community events with dates, titles, descriptions, and registration links for Afrobility Family CIC hosted events. Use card-based layout with event dates prominently displayed.","type":"feature","passes":true,"id":4},{"description":"Build complete donation page with Afrobility Family CIC mission statement, donation purpose clearly stated, fixed donation tiers (£10, £25, £50, £100), custom amount input field, and frequency options (One-time and Monthly recurring). Use warm color accents for donation buttons.","type":"feature","passes":true,"id":5},{"description":"Create secure admin dashboard with authenticated login page. Staff can log in with email and password to access administrative functions. Use dark mode theme consistent with website. Include navigation to donation tracker, financial summary, booking management, and CMS.","type":"feature","passes":true,"id":6},{"description":"Build donation tracker dashboard showing table with donor names, email addresses, donation amounts, dates, payment status (Completed/Pending), and donation frequency (One-time/Monthly). Include search and filter functionality by date range and amount.","type":"feature","passes":true,"id":7},{"description":"Create financial summary dashboard displaying 'Total Raised This Month', 'Total Annual Donations', 'Number of Donors', and 'Average Donation Amount'. Include charts showing donation trends over time and breakdown by frequency (one-time vs recurring).","type":"feature","passes":true,"id":8},{"description":"Build booking management system showing users who have booked Education Guidance and Support Group services. Display booking dates, user names, emails, service type, and booking status (Confirmed/Pending/Cancelled). Include ability to confirm or cancel bookings.","type":"feature","passes":true,"id":9},{"description":"Create content management system (CMS) interface for staff to add/edit/delete 'Our Insights' articles without coding. Include fields for title, author, description, featured image upload, publication date, and category tags. Add ability to save as draft or publish immediately.","type":"feature","passes":true,"id":10},{"description":"Integrate Stripe payment gateway into the donation page. Implement secure credit card processing, digital wallet support (Apple Pay, Google Pay), PCI compliance, and redirect to thank you page upon successful payment. Add support for both one-time and recurring monthly donations.","type":"feature","passes":true,"id":11},{"description":"Add automated email receipt system that sends branded confirmation emails to donors after successful payment. Include donation amount, donation date, and thank you message from Afrobility Family CIC. Configure email templates with organization branding.","type":"feature","passes":true,"id":12},{"description":"Create staff interface for managing 'Upcoming Events' in the CMS. Allow staff to add/edit/delete events with fields for event title, date, time, location, description, capacity, and registration link. Display event creation/edit status and ability to publish events to the website.","type":"feature","passes":true,"id":13},{"description":"Create user management interface for admin staff to add/remove other admin users for Afrobility Family CIC. Include role assignment (Admin, Editor, Viewer), email verification, and audit logs showing who made changes and when.","type":"feature","passes":true,"id":14},{"description":"Implement comprehensive SEO optimization with meta-tags for keywords: 'Disability Support for African Families', 'Caribbean Community Resources', 'African Families Mental Health', 'Community Services', and 'Afrobility Family CIC'. Add Open Graph tags for social sharing and optimize all page titles and descriptions.","type":"feature","passes":true,"id":15},{"description":"Create comprehensive footer with Afrobility Family CIC contact information (phone, email, address), social media links (Facebook, Twitter, Instagram, LinkedIn), newsletter signup form, links to privacy policy and terms of service. Use dark charcoal theme with warm mustard accents for links. Make responsive for mobile.","type":"feature","passes":true,"id":16},{"description":"Add Privacy Policy page detailing how Afrobility Family CIC handles donor information, website visitor data, and compliance with GDPR. Include sections on data collection, usage, and user rights. Link from footer.","type":"feature","passes":true,"id":17},{"description":"Create Terms of Service page outlining donation terms, service booking terms, content usage rights, and liability disclaimers for Afrobility Family CIC. Link from footer and during donation process.","type":"feature","passes":true,"id":18},{"description":"Optimize entire website for mobile devices including responsive navigation menu, collapsible service cards, mobile-friendly donation form, full-screen touch interactions, and fast loading on 3G. Test on various screen sizes (320px to 1400px+). Ensure all CTAs are thumb-friendly.","type":"feature","passes":true,"id":19},{"description":"Add SSL certificate and security headers. Implement PCI compliance for payment processing, secure password hashing for admin authentication, CORS protection, and rate limiting on login attempts. Enable HTTPS-only connections and security audit logging.","type":"feature","passes":true,"id":20},{"description":"Create admin account setup script that initializes the first admin user with email ayoluwanimi@gmail.com and password Cmmunity@1. This script should hash the password securely using bcrypt, create the user record in the database, and assign Admin role. Add a setup endpoint at /api/setup-admin that can be called once during initial deployment. After admin account is created, this endpoint should be disabled for security.","type":"feature","passes":true,"id":21}]